madubois/nrf9160-feather-examples-and-drivers/samples/kraken_tracker/src/main.c
	linear_mag = sqrtf((lx * lx) + (ly * ly) + (lz * lz));

	if (linear_mag < off_wake_start_threshold_ms2) {
		menu_wake_reset_motion();
		return false;
	}

	if (!menu_wake_probe_active) {
		menu_wake_probe_active = true;
	}

	if (linear_mag < off_wake_hold_threshold_ms2) {
		menu_wake_reset_motion();
		menu_wake_probe_active = true;
		return false;
	}

	if (++menu_wake_poll_streak < off_wake_required_streak) {
		return false;
	}

	return menu_wake_register_motion(now_ms);
}

static bool off_wake_poll_motion(int64_t now_ms)
{
	float linear_mag;
	float lx = linear_x;
	float ly = linear_y;
	float lz = linear_z;

	linear_mag = sqrtf((lx * lx) + (ly * ly) + (lz * lz));

	if (linear_mag < off_wake_start_threshold_ms2) {
		off_wake_reset_motion();
		return false;
	}

	if (!off_wake_probe_active) {
		off_wake_probe_active = true;
	}

	if (linear_mag < off_wake_hold_threshold_ms2) {
		off_wake_reset_motion();
		off_wake_probe_active = true;
		return false;
	}

	if (++off_wake_poll_streak < off_wake_required_streak) {
		return false;
	}

	return off_wake_register_motion(now_ms);
}

static void wake_trigger_handler(const struct device *dev, const struct sensor_trigger *trig)
{
	int64_t now_ms;

	ARG_UNUSED(dev);
	ARG_UNUSED(trig);

	now_ms = k_uptime_get();
	if (off_wake_register_motion(now_ms)) {
		wake_request = true;
		k_sem_give(&wake_sem);
	}
}

const char *menu_str[] = {
    "EXIT MENU",
	"GPS REACTIVATE",
	"RELOAD COORDINATES",
	"OFF"
};
int nb_menu = 4;

K_THREAD_STACK_DEFINE(accelerometer_stack, 1024);
K_THREAD_STACK_DEFINE(tap_stack, 1024);
K_THREAD_STACK_DEFINE(gps_stack, 1024);
K_THREAD_STACK_DEFINE(coordinates_stack, 2048);

struct k_thread accelerometer_data;
struct k_thread tap_data;
struct k_thread gps_data;
struct k_thread coordinates_data;

int measure_rate = 10;

float valuex = 0;
float valuey = 0;
float valuez = 0;
volatile float accel_x = 0.0f;
volatile float accel_y = 0.0f;
volatile float accel_z = 0.0f;
volatile float linear_x = 0.0f;
volatile float linear_y = 0.0f;
volatile float linear_z = 0.0f;

int tap_reset_rate = 20;
uint32_t last_fix = 0;
int gps_rate = 500;
volatile int first = 0;
uint32_t ref_lastfix = 0;
uint32_t last_gnss_diag = 0;
volatile bool gnss_display_dirty = true;
static int64_t tap_accept_after_ms;
static int64_t menu_confirm_after_ms;

enum gps_capture_mode {
	GPS_CAPTURE_DORMANT = 0,
	GPS_CAPTURE_REACTIVATING,
	GPS_CAPTURE_ACTIVE,
};

static volatile uint8_t gps_capture_mode = GPS_CAPTURE_REACTIVATING;
static bool active_point_valid;
static double active_point_lat;
static double active_point_lon;
static int64_t last_new_point_ms;
static bool gps_seen_fix_since_reactivate;
static volatile bool coordinates_fetch_running;

static void coordinates_thread(void *a, void *b, void *c);

#define GPS_NEW_POINT_MIN_DISTANCE_M 8
#define GPS_DORMANT_TIMEOUT_MS 120000

enum startup_stage {
	STARTUP_STAGE_GNSS_WARMUP = 0,
	STARTUP_STAGE_LTE_CONNECT,
	STARTUP_STAGE_DNS,
	STARTUP_STAGE_TCP_CONNECT,
	STARTUP_STAGE_HTTP_REQUEST,
	STARTUP_STAGE_WAIT_SERVER,
	STARTUP_STAGE_PARSE,
	STARTUP_STAGE_READY,
	STARTUP_STAGE_RETRY,
	STARTUP_STAGE_ERROR,
};

static volatile uint8_t startup_stage = STARTUP_STAGE_GNSS_WARMUP;

static const char *startup_stage_text(uint8_t stage)
{
	switch (stage) {
	case STARTUP_STAGE_GNSS_WARMUP:
		return "GNSS WARMUP";
	case STARTUP_STAGE_LTE_CONNECT:
		return "LTE CONNECT";
	case STARTUP_STAGE_DNS:
		return "DNS RESOLVE";
	case STARTUP_STAGE_TCP_CONNECT:
		return "TCP CONNECT";
	case STARTUP_STAGE_HTTP_REQUEST:
		return "HTTP REQUEST";
	case STARTUP_STAGE_WAIT_SERVER:
		return "WAIT SERVER";
	case STARTUP_STAGE_PARSE:
		return "PARSING DATA";
	case STARTUP_STAGE_READY:
		return "READY";
	case STARTUP_STAGE_RETRY:
		return "RETRY 60S";
	default:
		return "NET ERROR";
	}
}





void clear_display(const struct device *i2c_dev) {
	k_mutex_lock(&display_mutex, K_FOREVER);
	// 1. Efface le framebuffer RAM
	memset(framebuffer, 0, sizeof(framebuffer));

	// 2. Pour chaque page, envoie 128 zéros d'un coup
	for (uint8_t page = 0; page < SSD1306_PAGES; page++) {
		ssd1306_write_cmd(i2c_dev, 0x21); // Set column address
		ssd1306_write_cmd(i2c_dev, 0);    // Start column
		ssd1306_write_cmd(i2c_dev, SSD1306_WIDTH - 1);  // End column
		ssd1306_write_cmd(i2c_dev, 0x22); // Set page address
		ssd1306_write_cmd(i2c_dev, page); // Start page
		ssd1306_write_cmd(i2c_dev, page); // End page

		// Envoie 128 octets d'un coup (plus rapide que 128 appels séparés)
		uint8_t buf[129];
		buf[0] = 0x40; // Control byte for data
		memset(&buf[1], 0, SSD1306_WIDTH);
		i2c_write(i2c_dev, buf, sizeof(buf), SSD1306_I2C_ADDR);
	}
	k_mutex_unlock(&display_mutex);
}

void print_satellite_stats(struct nrf_modem_gnss_pvt_data_frame *pvt_data)
{
	uint8_t tracked = 0;
	uint8_t in_fix = 0;
	uint8_t unhealthy = 0;

	for (int i = 0; i < NRF_MODEM_GNSS_MAX_SATELLITES; ++i) {
		if (pvt_data->sv[i].sv <= 0) {
			continue;
		}

		tracked++;
		if (pvt_data->sv[i].flags & NRF_MODEM_GNSS_SV_FLAG_USED_IN_FIX) {
			in_fix++;
		}
		if (pvt_data->sv[i].flags & NRF_MODEM_GNSS_SV_FLAG_UNHEALTHY) {
			unhealthy++;
		}
	}

	gps_tracking = tracked;
	gps_using = in_fix;
	gps_unk = unhealthy;

	LOG_INF("GNSS searching: tracked=%u used=%u unhealthy=%u", tracked, in_fix, unhealthy);
}

void print_fix_data(struct nrf_modem_gnss_pvt_data_frame *pvt_data)
{
	struct tm tm = { 0 };

	tm.tm_year = pvt_data->datetime.year - 1900;
	tm.tm_mon = pvt_data->datetime.month - 1;
	tm.tm_mday = pvt_data->datetime.day;
	tm.tm_hour = pvt_data->datetime.hour;
	tm.tm_min = pvt_data->datetime.minute;
	tm.tm_sec = pvt_data->datetime.seconds;
	tm.tm_isdst = 0;

	timestamp = mktime(&tm);
	last_latitude = pvt_data->latitude;
	last_longitude = pvt_data->longitude;
}

void write_line(const struct device *i2c_dev, const char *line, uint8_t x, uint8_t y, int erase);

int blocking_send(int fd, uint8_t *buf, uint32_t size, uint32_t flags)
{
	int err;

	do {
		err = send(fd, buf, size, flags);
	} while (err < 0 && errno == EAGAIN);

	return err;
}

int blocking_connect(int fd, struct sockaddr *local_addr, socklen_t len)
{
	int err;

	do {
		err = connect(fd, local_addr, len);
	} while (err < 0 && errno == EAGAIN);

