madubois/nrf9160-feather-examples-and-drivers/samples/kraken_tracker/src/main.c
							}
							//print_distance_from_reference(&last_pvt);


						} else {
							gnss_has_fix = false;

							last_fix = (uint32_t)((k_uptime_get() - fix_timestamp) / 1000);
							gnss_display_dirty = true;

							if (gps_capture_mode == GPS_CAPTURE_ACTIVE &&
							    gps_seen_fix_since_reactivate &&
							    ((int64_t)last_fix * 1000) >= GPS_DORMANT_TIMEOUT_MS) {
								gps_capture_mode = GPS_CAPTURE_DORMANT;
								gnss_display_dirty = true;
								LOG_INF("GPS capture dormant: signal lost for 2 minutes after at least one fix");
							}

							if ((k_uptime_get_32() - last_gnss_diag) >= 5000U) {
								LOG_WRN("GNSS searching: tracked=%u used=%u unhealthy=%u last_fix=%us antenna=%s",
									gps_tracking,
									gps_using,
									gps_unk,
									last_fix,
									gnss_antenna_mode());
								last_gnss_diag = k_uptime_get_32();
							}

						}

}



}

void exit_menu(const struct device *i2c_dev){

	menu = -1;
	clear_display(i2c_dev);

}

void change_gps(const struct device *i2c_dev){

uint8_t x = 5*6, y = 8;
char message[128];
if(gps_state == 0){
	gps_state = 1;
	snprintf(message, sizeof(message), " ON ");
						}else{
							gps_state = 0;
							snprintf(message, sizeof(message), " OFF");
						}
				for (const char *p = message; *p; p++) {
					dessiner_caractere(i2c_dev, *p, x, y,1);
					x += 6;

				}
}

void change_lte(const struct device *i2c_dev){

uint8_t x = 5*6, y = 16;
char message[128];
if(lte_state == 0){
	lte_state = 1;
	snprintf(message, sizeof(message), " ON ");
						}else{
							lte_state = 0;
							snprintf(message, sizeof(message), " OFF");
						}
				for (const char *p = message; *p; p++) {
					dessiner_caractere(i2c_dev, *p, x, y,1);
					x += 6;

				}
}

void reload_coordinates(const struct device *i2c_dev){
	ARG_UNUSED(i2c_dev);

	menu = -1;
	first = 0;
	gnss_display_dirty = true;
	startup_stage = STARTUP_STAGE_GNSS_WARMUP;

	if (!coordinates_fetch_running) {
		coordinates_fetch_running = true;
		if (k_thread_create(&coordinates_data, coordinates_stack,
				   K_THREAD_STACK_SIZEOF(coordinates_stack),
				   coordinates_thread, NULL, NULL, NULL, 7, 0, K_NO_WAIT) == NULL) {
			coordinates_fetch_running = false;
			startup_stage = STARTUP_STAGE_ERROR;
			LOG_ERR("reload_coordinates: failed to start coordinates thread");
		}
	} else {
		LOG_INF("reload_coordinates: fetch already running");
	}
}


void coordinates_thread(void *a, void *b, void *c)
{
	ARG_UNUSED(a);
	ARG_UNUSED(b);
	ARG_UNUSED(c);
	coordinates_fetch_running = true;

	/* Give GNSS priority at boot to avoid starving early satellite acquisition. */
	startup_stage = STARTUP_STAGE_GNSS_WARMUP;
	int64_t warmup_deadline = k_uptime_get() + 30000;
	while (!gnss_has_fix && k_uptime_get() < warmup_deadline) {
		k_sleep(K_SECONDS(1));
	}
	LOG_INF("coordinates_thread: GNSS warmup complete (fix=%d), starting LTE fetch", gnss_has_fix ? 1 : 0);

	while (1) {
		k_mutex_lock(&lte_mutex, K_FOREVER);
		startup_stage = STARTUP_STAGE_LTE_CONNECT;
		lte_connect();
		LOG_INF("coordinates_thread: starting coordinates fetch");
		initial_connexion();
		lte_disconnect();
		k_mutex_unlock(&lte_mutex);

		if (targets_count > 0) {
			LOG_INF("coordinates_thread: loaded %d targets", targets_count);
			startup_stage = STARTUP_STAGE_READY;
			break;
		}

		LOG_WRN("coordinates_thread: no targets yet, retrying in 60s");
		startup_stage = STARTUP_STAGE_RETRY;
		k_sleep(K_SECONDS(60));
	}

	coordinates_fetch_running = false;
}
void firmware_update(const struct device *i2c_dev){


if(lte_state == 0){return; }

	clear_display(i2c_dev);


	uint8_t x = 5*6, y = 16;
	

	x=0;
	y=0;

		char line[128];
		snprintf(line,sizeof(line),"Initialization...");
		for (const char *p = line; *p; p++) {
			dessiner_caractere(i2c_dev, *p, x, y,0);
			x += 6;

		}









	flash_firmware();


	menu = -1;
	first = 0;

}

void ssd1306_power_off(const struct device *i2c_dev) {
	k_mutex_lock(&display_mutex, K_FOREVER);
    ssd1306_write_cmd(i2c_dev, 0xAE); // Display OFF
	k_mutex_unlock(&display_mutex);
}

void ssd1306_power_on(const struct device *i2c_dev) {
	k_mutex_lock(&display_mutex, K_FOREVER);
    ssd1306_write_cmd(i2c_dev, 0xAF); // Display ON
	k_mutex_unlock(&display_mutex);
}

void off(const struct device *i2c_dev){
	int err;
	int trigger_err;
	int modem_err;
	struct pm_state_info soft_off_state = {
		.state = PM_STATE_SOFT_OFF,
		.substate_id = 0,
		.min_residency_us = 0,
	};

	LOG_WRN("Entering deep sleep mode");
	menu = -1;
	first = 0;
	gps_capture_mode = GPS_CAPTURE_DORMANT;
	gps_seen_fix_since_reactivate = false;
	active_point_valid = false;
	last_new_point_ms = 0;
	gnss_display_dirty = true;
	last_tracked = 0xFF;
	last_in_fix = 0xFF;
	last_unhealthy = 0xFF;

	k_mutex_lock(&state.mutex, K_FOREVER);
	state.ready = false;
	k_mutex_unlock(&state.mutex);
	off_mode_active = true;

	if (nrf_modem_gnss_stop() != 0) {
		LOG_WRN("Failed to stop GNSS before deep sleep");
	}

	k_mutex_lock(&lte_mutex, K_FOREVER);
	lte_disconnect();
	err = lte_lc_func_mode_set(LTE_LC_FUNC_MODE_POWER_OFF);
	if (err != 0) {
		LOG_WRN("Failed to set modem power off mode: %d", err);
	}
	modem_err = nrf_modem_lib_shutdown();
	if (modem_err != 0) {
		LOG_WRN("Failed to shutdown modem library in OFF mode: %d", modem_err);
	}
	k_mutex_unlock(&lte_mutex);
	lte_state = 0;

	/* Clear the tap event that likely triggered OFF so we don't wake immediately. */
	pop_tap_event();
	pop_wake_request();
	k_sem_reset(&wake_sem);
	off_wake_reset_motion();
	/* Give the board time to settle so the same OFF tap does not instantly wake it back up. */
	off_wake_armed_after_ms = k_uptime_get() + 1500;
	{
		struct sensor_value odr = {
			.val1 = off_wake_odr_hz,
			.val2 = 0,
		};
		int odr_err = sensor_attr_set(accel_sensor, SENSOR_CHAN_ACCEL_XYZ,
					      SENSOR_ATTR_SAMPLING_FREQUENCY, &odr);
		if (odr_err != 0) {
			LOG_WRN("Unable to lower accelerometer ODR for OFF wake: %d", odr_err);
		}
	}

	(void)wake_trigger;
	(void)wake_trigger_handler;
	trigger_err = sensor_trigger_set(accel_sensor, &wake_trigger, wake_trigger_handler);
	if (trigger_err != 0) {
		LOG_WRN("Unable to arm accelerometer wake trigger: %d", trigger_err);
	}

	/* Ensure IRQ pin has wake sense enabled for System OFF wake-up. */
	nrf_gpio_cfg_input(NRF_DT_GPIOS_TO_PSEL(DT_NODELABEL(lis2dh), irq_gpios),
			  NRF_GPIO_PIN_NOPULL);
	nrf_gpio_cfg_sense_set(NRF_DT_GPIOS_TO_PSEL(DT_NODELABEL(lis2dh), irq_gpios),
			      NRF_GPIO_PIN_SENSE_HIGH);

