madubois/nrf9160-feather-examples-and-drivers/samples/kraken_tracker/src/main.c
	ssd1306_power_off(i2c_dev);
	tap_accept_after_ms = k_uptime_get() + (24LL * 60LL * 60LL * 1000LL);

	if (off_use_system_off) {
		LOG_WRN("OFF ECO: entering System OFF (wake on LIS2DH motion IRQ)");
		pm_state_force(0u, &soft_off_state);
		k_sleep(K_FOREVER);

		/* If we ever return here, force a clean restart as a safety fallback. */
		LOG_ERR("System OFF failed; forcing cold reboot");
		sys_reboot(SYS_REBOOT_COLD);
	}

	LOG_WRN("OFF SAFE: using motion polling wake strategy");
	bool charge_screen_on = false;
	uint8_t charge_displayed_pct = 0xFF;
	int charge_prev_mv = -1;
	int charge_rise_score = 0;
	int64_t next_charge_poll_ms = 0;
	char charge_line[32];
	int wait_ms = off_wake_idle_wait_ms;
	while (1) {
		int64_t now_ms = k_uptime_get();

		if (now_ms >= next_charge_poll_ms) {
			uint8_t batt_pct = 0;
			int batt_mv = 0;
			bool likely_external_power = false;

			next_charge_poll_ms = now_ms + 5000;
			if (board_battery_percent_get(&batt_pct, &batt_mv) == 0) {
				/* Heuristic: charging input is likely present if VBAT is already high,
				 * or rises repeatedly between OFF samples.
				 */
				if (batt_mv >= 4180) {
					likely_external_power = true;
				}
				if (charge_prev_mv >= 0) {
					if (batt_mv >= charge_prev_mv + 8) {
						if (charge_rise_score < 3) {
							charge_rise_score++;
						}
					} else if (batt_mv + 4 < charge_prev_mv) {
						if (charge_rise_score > 0) {
							charge_rise_score--;
						}
					}
				}
				charge_prev_mv = batt_mv;
				if (charge_rise_score >= 2) {
					likely_external_power = true;
				}

				if (likely_external_power) {
					if (!charge_screen_on) {
						ssd1306_power_on(i2c_dev);
						clear_display(i2c_dev);
						charge_screen_on = true;
						charge_displayed_pct = 0xFF;
					}
					if (charge_displayed_pct != batt_pct) {
						write_line(i2c_dev, "CHARGING       ", 0, 16, 1);
						snprintf(charge_line, sizeof(charge_line), "%2u%%", batt_pct);
						write_line(i2c_dev, charge_line, 0, 24, 1);
						charge_displayed_pct = batt_pct;
					}
				} else if (charge_screen_on) {
					clear_display(i2c_dev);
					ssd1306_power_off(i2c_dev);
					charge_screen_on = false;
					charge_displayed_pct = 0xFF;
				}
			}
		}

		if (k_sem_take(&wake_sem, K_MSEC(wait_ms)) == 0) {
			break;
		}

		if (off_wake_poll_motion(k_uptime_get())) {
			break;
		}

		wait_ms = off_wake_probe_active ? off_wake_fast_wait_ms : off_wake_idle_wait_ms;
	}

	(void)sensor_trigger_set(accel_sensor, &wake_trigger, NULL);
	LOG_WRN("OFF SAFE wake detected: rebooting for full cold boot session");
	sys_reboot(SYS_REBOOT_COLD);

}

void write_line(const struct device *i2c_dev, const char *line, uint8_t x, uint8_t y, int erase) {
	if (y > (SSD1306_HEIGHT - 7)) {
		return;
	}

	int cursor = x;
	for (const char *p = line; *p; p++) {
		if (cursor > (SSD1306_WIDTH - 5)) {
			break;
		}

		dessiner_caractere(i2c_dev, *p, (uint8_t)cursor, y, erase);
		cursor += 6;
	}
}

static void draw_menu_screen(const struct device *i2c_dev)
{
	uint8_t y = 0;
	char message[128];

	clear_display(i2c_dev);

	for (int i = 0; i < nb_menu; i++) {
		snprintf(message, sizeof(message), "%s", menu_str[i]);
		write_line(i2c_dev, message, 6, y, 0);

		y += 8;
	}

	write_line(i2c_dev, ">", 0, menu * 8, 0);
}

static void open_menu(const struct device *i2c_dev)
{
	menu = 0;
	menu_confirm_after_ms = k_uptime_get() + tap_menu_confirm_guard_ms;
	menu_wake_reset_motion();
	draw_menu_screen(i2c_dev);
}

static void move_menu_cursor(const struct device *i2c_dev, int delta)
{
	char marker[2] = " ";

	write_line(i2c_dev, marker, 0, menu * 8, 1);
	menu = (menu + delta + nb_menu) % nb_menu;
	menu_confirm_after_ms = k_uptime_get() + tap_menu_confirm_guard_ms;
	marker[0] = '>';
	write_line(i2c_dev, marker, 0, menu * 8, 0);
}

static void execute_menu_selection(const struct device *i2c_dev)
{
	LOG_INF("MENU CHOISI: %s", menu_str[menu]);

	switch (menu) {
	case 0:
		exit_menu(i2c_dev);
		first = 0;
		last_tracked = 0;
		last_fix = 0;
		last_in_fix = 0;
		last_unhealthy = 0;
		last_latitude = 0;
		last_longitude = 0;
		break;
	case 1:
		gps_capture_mode = GPS_CAPTURE_ACTIVE;
		last_new_point_ms = k_uptime_get();
		gps_seen_fix_since_reactivate = false;
		if (last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_FIX_VALID) {
			print_fix_data(&last_pvt);
			active_point_lat = last_latitude;
			active_point_lon = last_longitude;
			active_point_valid = true;
			gps_seen_fix_since_reactivate = true;
			LOG_INF("GPS capture mode set to ACTIVE (instant fix)");
		} else {
			active_point_valid = false;
			LOG_INF("GPS capture mode set to ACTIVE (waiting for first fix)");
		}
		/* Always refresh signal counters immediately when exiting dormant. */
		print_satellite_stats(&last_pvt);
		last_tracked = 0xFF;
		last_in_fix = 0xFF;
		last_unhealthy = 0xFF;
		gnss_display_dirty = true;
		menu = -1;
		first = 0;
		break;
	case 2:
		reload_coordinates(i2c_dev);
		first = 0;
		break;
	case 3:
		off(i2c_dev);
		break;
	default:
		break;
	}

	if (menu >= 0) {
		draw_menu_screen(i2c_dev);
	}
}

int main(void)
{

	k_mutex_init(&display_mutex);
	k_mutex_init(&lte_mutex);
	k_mutex_init(&tap_mutex);
	k_mutex_init(&motion_mutex);
	k_mutex_init(&state.mutex);
	k_condvar_init(&state.cond);
	k_condvar_init(&motion_cond);
	k_sem_init(&wake_sem, 0, 1);
	state.ready = false;
	uint8_t x = 0, y = 0;
	char message[128];
	int err;
	bool home_screen_cleared = false;
	uint8_t battery_pct = 0;
	uint8_t displayed_battery_pct = 0xFF;
	uint8_t displayed_startup_stage = 0xFF;
	uint8_t displayed_startup_visible = 0xFF;
	bool battery_valid = false;
	int64_t next_battery_poll_ms = 0;
	tap_accept_after_ms = k_uptime_get() + tap_boot_guard_ms;
	menu_confirm_after_ms = 0;

	//const struct device *i2c_dev = DEVICE_DT_GET(DT_NODELABEL(i2c1));
	if (!device_is_ready(i2c_dev)) {
		LOG_ERR("I2C device not ready");
		while (true) {
			k_sleep(K_SECONDS(1));
		}
	}
	LOG_INF("I2C device is ready");
	LOG_INF("GNSS antenna mode: %s", gnss_antenna_mode());

	ssd1306_init(i2c_dev);
	draw_startup_logo(i2c_dev);
	k_sleep(K_MSEC(logo_preview_ms));

	clear_display(i2c_dev);
	snprintf(message, sizeof(message), "T: %2d U: %2d UN: %d", 0, 0, 0);
	write_line(i2c_dev, message, 0, 0, 0);
	snprintf(message, sizeof(message), "LAST FIX: %d", 0);
	write_line(i2c_dev, message, 0, 8, 0);
	write_line(i2c_dev, "--%", 18 * 6, 8, 0);
	snprintf(message, sizeof(message), "                ");
	write_line(i2c_dev, message, 0, 32, 0);
	home_screen_cleared = true;
	first = 0;

