madubois/nrf9160-feather-examples-and-drivers/samples/kraken_tracker/src/main.c
	accel_sensor = DEVICE_DT_GET_ONE(st_lis2dh);
	if (!device_is_ready(accel_sensor)) {
        LOG_ERR("Erreur : LIS2DH non prêt\n");
		while (true) {
			k_sleep(K_SECONDS(1));
		}
    }

	{
		struct sensor_value odr = {
			.val1 = active_odr_hz,
			.val2 = 0,
		};
		int odr_err = sensor_attr_set(accel_sensor, SENSOR_CHAN_ACCEL_XYZ,
					      SENSOR_ATTR_SAMPLING_FREQUENCY, &odr);
		if (odr_err != 0) {
			LOG_WRN("Unable to set accelerometer sampling frequency: %d", odr_err);
		}
	}

	k_thread_create(&accelerometer_data, accelerometer_stack, 1024,accelerometer_thread, (void *)accel_sensor, NULL, NULL,5, 0, K_NO_WAIT);
	k_thread_create(&tap_data, tap_stack, 1024,tap_thread, NULL, NULL, NULL,5, 0, K_NO_WAIT);
	k_thread_create(&gps_data, gps_stack, 1024,gps_thread, NULL, NULL, NULL,5, 0, K_NO_WAIT);


	err = nrf_modem_lib_init();
	if (err) {
		LOG_ERR("Modem library initialization failed, error: %d", err);
		while (true) {
			k_sleep(K_SECONDS(1));
		}
	}

	log_modem_state("After modem init");

	/* Initialize reference coordinates (if used). */
	if (sizeof(CONFIG_GNSS_SAMPLE_REFERENCE_LATITUDE) > 1 &&
	    sizeof(CONFIG_GNSS_SAMPLE_REFERENCE_LONGITUDE) > 1) {
		ref_used = true;
		ref_latitude = atof(CONFIG_GNSS_SAMPLE_REFERENCE_LATITUDE);
		ref_longitude = atof(CONFIG_GNSS_SAMPLE_REFERENCE_LONGITUDE);
	}

	if (modem_init() != 0) {
		LOG_ERR("Failed to initialize modem");
		while (true) {
			k_sleep(K_SECONDS(1));
		}
	}

	if (sample_init() != 0) {
		LOG_ERR("Failed to initialize sample");
		while (true) {
			k_sleep(K_SECONDS(1));
		}
	}

	if (gnss_init_and_start() != 0) {
		LOG_ERR("Failed to initialize and start GNSS");
		while (true) {
			k_sleep(K_SECONDS(1));
		}
	}

	/* Explicit runtime init: always begin with a fresh GPS reactivation cycle at boot. */
	gps_capture_mode = GPS_CAPTURE_REACTIVATING;
	active_point_valid = false;
	last_new_point_ms = 0;
	gps_seen_fix_since_reactivate = false;
	gnss_display_dirty = true;
	last_tracked = 0xFF;
	last_in_fix = 0xFF;
	last_unhealthy = 0xFF;

	LOG_INF("main: GNSS started, scheduling coordinates thread");
	k_thread_create(&coordinates_data, coordinates_stack, K_THREAD_STACK_SIZEOF(coordinates_stack),
			coordinates_thread, NULL, NULL, NULL, 7, 0, K_NO_WAIT);

	LOG_INF("main: starting initial GNSS phase");
	LOG_INF("GPS capture mode at boot: REACTIVATING");
	fix_timestamp = k_uptime_get();

	while(true){

		int64_t now_ms = k_uptime_get();
		if (now_ms >= next_battery_poll_ms) {
			int battery_mv = 0;

			next_battery_poll_ms = now_ms + 30000;
			if (board_battery_percent_get(&battery_pct, &battery_mv) == 0) {
				battery_valid = true;
				LOG_DBG("Battery(board ADC): %d mV => %u%%", battery_mv, battery_pct);
			} else {
				battery_valid = false;
			}
		}

	if(menu == -1){
		int visible_targets = targets_count;
		int layout_rows;
		bool show_startup_stage = (startup_stage != STARTUP_STAGE_READY) || (targets_count <= 0);
		uint8_t targets_base_y = show_startup_stage ? 32 : 24;

		if (visible_targets > MAX_DISPLAY_TARGETS) {
			visible_targets = MAX_DISPLAY_TARGETS;
		}
		if (visible_targets < 0) {
			visible_targets = 0;
		}
		layout_rows = show_startup_stage ? 0 : visible_targets;

		if (!home_screen_cleared) {
			clear_display(i2c_dev);
			home_screen_cleared = true;
		}

		if(first == 0){
					
			clear_display(i2c_dev);
			snprintf(message, sizeof(message), "T: %2d U: %2d UN: %d", 0, 0, 0);
			write_line(i2c_dev, message, 0, 0, 0);

			snprintf(message, sizeof(message), "LAST FIX: %d",0);
			write_line(i2c_dev, message, 0, 8, 0);
			write_line(i2c_dev, "--%", 18 * 6, 8, 0);
			write_line(i2c_dev, "                     ", 0, 24, 0);
			displayed_battery_pct = 0xFF;
			draw_target_rows_layout(i2c_dev, layout_rows, targets_base_y);


		}

		if (displayed_targets_count != layout_rows ||
		    displayed_startup_visible != (show_startup_stage ? 1 : 0)) {
			draw_target_rows_layout(i2c_dev, layout_rows, targets_base_y);
			gnss_display_dirty = true;
		}

		if (show_startup_stage) {
			if (displayed_startup_stage != startup_stage || displayed_startup_visible != 1) {
				snprintf(message, sizeof(message), "%s", startup_stage_text(startup_stage));
				write_line(i2c_dev, "                     ", 0, 24, 1);
				write_line(i2c_dev, message, 0, 24, 1);
				displayed_startup_stage = startup_stage;
				displayed_startup_visible = 1;
			}
		} else if (displayed_startup_visible != 0) {
			/* Do not blank y=24 here: this row is reused by target line #1 in READY state. */
			displayed_startup_visible = 0;
			displayed_startup_stage = startup_stage;
			gnss_display_dirty = true;
		}

		if(last_fix != ref_lastfix){
			ref_lastfix = last_fix;
			y=8;
			x=10*6;

			snprintf(message, sizeof(message), "%d   ",last_fix);
			write_line(i2c_dev, message, x,y,1);

		}

		if (!battery_valid) {
			if (displayed_battery_pct != 0xFE) {
				write_line(i2c_dev, "--%", 18 * 6, 8, 1);
				displayed_battery_pct = 0xFE;
			}
		} else if (displayed_battery_pct != battery_pct) {
			snprintf(message, sizeof(message), "%2u%%", battery_pct);
			write_line(i2c_dev, message, 18 * 6, 8, 1);
			displayed_battery_pct = battery_pct;
		}

		if(gps_state == 1 || first == 0){

			first = 1;
			y = 0;

			if (gps_capture_mode == GPS_CAPTURE_DORMANT) {
				x = 3 * 6;
				write_line(i2c_dev, "--", x, y, 1);
				x = 9 * 6;
				write_line(i2c_dev, "--", x, y, 1);
				x = 16 * 6;
				write_line(i2c_dev, "--", x, y, 1);

				/* Force refresh of numeric counters when leaving dormant mode. */
				last_tracked = 0xFF;
				last_in_fix = 0xFF;
				last_unhealthy = 0xFF;
			} else {

			if(last_tracked != gps_tracking){


				x=3*6;

				snprintf(message, sizeof(message), "%2d", gps_tracking);
				write_line(i2c_dev, message,x,y,1);

				last_tracked = gps_tracking;

			}

			if(last_in_fix != gps_using){

				x=9*6;
				snprintf(message, sizeof(message), "%2d", gps_using);

				write_line(i2c_dev,message,x,y,1);


				last_in_fix = gps_using;
			}

			if(last_unhealthy != gps_unk){

			x=16*6;
			snprintf(message, sizeof(message), "%2d", gps_unk);

			write_line(i2c_dev,message,x,y,1);

			last_unhealthy = gps_unk;

