madubois/nrf9160-feather-examples-and-drivers/samples/kraken_tracker/src/main.c
			}
			}

			if(lte_state == 1 && gps_using >= 4 && gps_capture_mode == GPS_CAPTURE_ACTIVE){

			if(position >= 5*20){

				position = 0;

				k_mutex_lock(&lte_mutex, K_SECONDS(60));

				send_to_cloud();

				k_mutex_unlock(&lte_mutex);

			}

			if((position+20) % 20 == 0){
				ts[position/20] = timestamp;
				lat[position/20] = active_point_valid ? (float)active_point_lat : (float)last_latitude;
				lng[position/20] = active_point_valid ? (float)active_point_lon : (float)last_longitude;
			}

			position++;



			}

		double calc_latitude = active_point_valid ? active_point_lat : last_latitude;
		double calc_longitude = active_point_valid ? active_point_lon : last_longitude;

		if(!show_startup_stage &&
		   (gnss_display_dirty || fabs(ref_latitude2 - calc_latitude) > 0.00001 || fabs(ref_longitude2 - calc_longitude) > 0.00001)){

			ref_latitude2 = calc_latitude;
			ref_longitude2 = calc_longitude;
			gnss_display_dirty = false;

x = 0;
y = targets_base_y;

for(int i=0;i<visible_targets;i++){

	if (y > (SSD1306_HEIGHT - 8)) {
		break;
	}

	int heading, distance;

	calcul_cap_distance_int(calc_latitude, calc_longitude, targets[i*2], targets[i*2+1], &heading, &distance);

	if(distance > 10000){
		distance = 9999;
	}


	x = 3*6;
	if (displayed_heading[i] != heading) {
		snprintf(message, sizeof(message), "%3d", heading);
		write_line(i2c_dev, message, x, y, 1);
		displayed_heading[i] = heading;
	}

	x = 14*6;
	if (displayed_distance[i] != distance) {
		snprintf(message, sizeof(message), "%4d", distance);
		write_line(i2c_dev, message, x, y, 1);
		displayed_distance[i] = distance;
	}

	y+= 8;
	x = 0;
}

}

		}

		}

		if (menu == -1 && k_uptime_get() >= tap_accept_after_ms) {
			if (menu_wake_poll_motion(k_uptime_get())) {
				LOG_INF("GOING IN THE MENU");
				open_menu(i2c_dev);
				k_sleep(K_MSEC(100));
				continue;
			}
		} else {
			menu_wake_reset_motion();
		}

		enum tap_direction tap = pop_tap_event();
		if (tap != TAP_NONE) {
			if (k_uptime_get() < tap_accept_after_ms) {
				k_sleep(K_MSEC(100));
				continue;
			}

			if (menu != -1) {
				switch (tap) {
				case TAP_UP:
					/* Haut physique: descendre le curseur dans la liste. */
					move_menu_cursor(i2c_dev, +1);
					break;
				case TAP_DOWN:
					/* Bas physique: remonter le curseur. */
					move_menu_cursor(i2c_dev, -1);
					break;
				case TAP_LEFT:
					/* Gauche physique: confirmer/entrer. */
					if (k_uptime_get() >= menu_confirm_after_ms) {
						execute_menu_selection(i2c_dev);
					}
					break;
				case TAP_RIGHT:
					/* Droite physique: inactif pour l'instant. */
					break;
				default:
					break;
				}
			}
		}

		k_sleep(K_MSEC(100));	

	}

	return 0;
}
